[
    {
        "text": "I was born on January 27, 1991, in Cherkasy, Ukraine. From a young age, I studied at an art school, where I first discovered my passion for drawing and painting. In 2008, I began my studies at the local university, enrolling in the Faculty of Decorative Arts. During my first year, I made a firm decision — to become an artist. That moment marked a turning point in my life."
    },
    {
        "text": "As I immersed myself in the world of art, I began discovering the great masters of the past and visited art museums in Kyiv, deeply moved by the masterpieces I saw. I painted and drew more and more, driven by the desire to improve. While my formal studies gradually became less engaging, I found new passion in plein air painting and the freedom it offered. University gave me valuable access to studio spaces, classical studies like gypsum sculptures, and a community of fellow art lovers."
    },
    {
        "text": "In July of that period, I held a group exhibition with two fellow students at the Cherkasy Regional Art Museum, where I exhibited 18 watercolor and oil paints works."
    },
    {
        "text": "After graduating in 2012, I rented a studio where I could paint almost every day. 2013 and early 2014 became one of the most productive times in my life, filled with landscapes and still lifes. My style evolved from classical 'baroque' influences toward the beginnings of abstraction. But in February 2014, I stopped painting for nearly three years. I told myself I'd return when the 'better times' came — but they didn't. Time just passed."
    },
    {
        "text": "Everything changed on New year's Day, 2017. Tired of waiting, I realized the best time to create is now. I returned to painting, beginning with the view from my window — familiar, yet transformed by a new perspective. That spring and summer, I painted outdoors in my hometown and nearby villages."
    },
    {
        "text": "In 2018, after only a brief visit to Budapest the year before, I accepted a job offer in Gdańsk, Poland. The work was light, and I was eager to explore Europe. I fell in love with the city's old town, seaside, and parks. While there, I created several oil paintings in Oliwski Park and Śródmieście. During this time, friends invited me to visit Denmark. I was immediately drawn to the country and dreamed of returning."
    },
    {
        "text": "In March 2019, I had the chance to work in Denmark. Though the first weeks were difficult, I adjusted and began exploring towns, galleries, and museums. On a visit to Odense, I discovered Filosoffen — an art café and gallery space. The kind staff invited me to exhibit my work that November. I showed 11 paintings brought from Ukraine. The opening was warm and welcoming, and I returned home inspired."
    },
    {
        "text": "Due to the COVID-19 pandemic, I remained in Ukraine for over a year and settled in the beautiful town of Kamianka, known for its Tiasmyn Canyon and breathtaking views. Starting in early spring, I painted outdoors almost every morning, creating many new works. In spring 2021, I continued capturing local landscapes and townscapes."
    },
    {
        "text": "From July to September 2021, I spent two months in Athens. The Mediterranean sun, ancient architecture, and endless inspiration made it one of the most memorable times of my life. I wandered streets, beaches, and historic sites in search of the best views, painting as much and as well as I could. Staying in a hostel, I met people from around the world, adding even more color to the experience."
    },
    {
        "text": "In September 2021, I returned to Ukraine, already planning my next adventure — perhaps the most beautiful place yet. But everything changed on February 24, 2022, when russia launched its full-scale invasion of Ukraine. In the spring, painting no longer felt important; my thoughts were with my family, my country, and the uncertain future."
    },
    {
        "text": "By summer, I began painting again as a way to cope. I created landscapes in my hometown and rented an apartment with a view of the river. There, I returned to still lifes and interiors — subjects I hadn't explored in nearly a decade. This became another deeply creative and prolific chapter in my life."
    },
    {
        "text": "In September 2023, I began teaching at an art college. It's more than just a job — I now guide young students in drawing and painting, helping them discover the joy and wonder of the art world, just as I once did."
    },
    {
        "text": "In the fall of 2024, I started learning web development. Nearly every evening after work, I explored this new field, which quickly sparked my interest. I created this website on my own as a final project that reflects the skills and knowledge I’ve acquired over this time."
    }
]