[
    {
        "tab": "Early Years",
        "paragraphs": [
            "Studying at the local university laid the foundation for my development as an artist.",
            "It was there that I made the firm decision to pursue this path. A pivotal moment in my journey was meeting a true artist — my instructor in drawing, painting, and art history. Through his guidance, I came to understand that painting is not merely about creating 'pictures for to like' or replicating what one sees. I realized that art is a meaningful and noble endeavor, truly worth dedicating oneself to.",
            "With each passing year, I immersed myself more deeply in the practice. Over time, the academic side of university began to feel less relevant — useful mainly as a warm space in the colder months where I could continue to refine my drawing skills. The structured learning grew monotonous, yet within that space I found kindred spirits — fellow students who, like me, took art seriously and were committed to its pursuit.",
            "Around that time, I developed a keen interest in the great artists of the past — those whose works hang in the world's finest museums. I was drawn not only to their masterpieces but also to the stories of their lives and struggles. Learning about their paths became a powerful source of inspiration, pushing me to sharpen my own skills and deepen my perception.",
            "In the spring of my third year, I began spending more time painting outdoors, often retreating to a house in the countryside. It was during these plein air sessions that I first truly grasped the essence of color and composition. These moments — under the open sky, surrounded by nature — offered insights no classroom ever could."
        ],
        "images": [
            {
                "id": 1,
                "title": "Drawing in university",
                "src": "../resources/img/periods/101.jpg"
            }
        ]
    },
    {
        "tab": "A Creative Breakthrough",
        "paragraphs": [
            "In the winter of 2012-2014, I began renting an art studio — a space where I could finally focus fully on painting. It became a turning point. That year, 2013, remains one of the most prolific periods of my life. I created numerous landscapes and still lifes, both in the studio and outdoors. It was during this time that my artistic style began to shift: I moved away from Baroque influences toward a simpler, brighter palette, edging toward abstraction.",
            "I treated my studio like a full-time job, painting almost every day. Outside, I focused on landscapes of my hometown — especially the Dnipro River with its beautiful shores. I rarely painted architecture, as much of it was post-Soviet and didn't inspire me. But nature always did.",
            "In the autumn, I returned to the studio, focusing on still lifes. Though I had a limited number of objects, I explored new arrangements, played with color, form, and perspective, and focused on harmony between shapes and shades. I was searching for the exact right tone to express my senses — how colors could interact on the canvas to say more than words.",
            "Then, in February 2014, everything paused. I stopped painting — for nearly three years. I told myself I was waiting for better times. But, as it often goes, better times didn't come… only time passed."
        ],
        "images": []
    },
    {
        "tab": "Return to Painting",
        "paragraphs": [
            "Everything changed at the start of 2017. Reflecting on the past few years, I felt something was missing — and I realized it was painting. After such a long break, returning to my practice was a challenge. It felt like starting over. But I was ready.",
            "I rented an apartment and began painting the view from my window. At first glance, it seemed ordinary — but over time, I realized that the challenge wasn't the view itself, but how I perceived it. I allowed myself to reimagine it, to change elements, shift colors, and explore different moods. Though the view stayed the same, each painting had to feel fresh and alive. It became an exercise in creativity — how to transform the familiar into something new.",
            "I worked mostly in small formats, using cardboard. When spring and summer arrived, I painted often outdoors, usually around my hometown of Cherkasy. Sometimes, I traveled to nearby villages to capture different scenes. I continued painting regularly through to the winter, rediscovering the joy and rhythm of my creative process."
        ],
        "images": [
            {
                "id": 1,
                "title": "In the shadows_view",
                "src": "../resources/img/periods/301.jpg"
            }
        ]
    },
    {
        "tab": "First Steps into Europe",
        "paragraphs": [
            "By spring 2018, I had a strong desire to travel abroad — not just for new experiences, but to see the great museums, galleries, and historic streets of Europe, and to meet new people. Aside from a short weekend trip to Budapest in 2017, I had never been outside Ukraine. That year, I accepted an opportunity to work a light job in Gdańsk, Poland — an offer I gladly took.",
            "Gdańsk immediately enchanted me. Its charming old streets, historic buildings, vibrant tourist life, galleries, parks, and seaside atmosphere made a strong impression. One of my favorite places quickly became Oliwski Park — a truly beautiful and peaceful setting. I began sketching there regularly, especially in the mornings before work, which didn't start until the afternoon.",
            "After about two months, I transitioned from sketching to painting. My early works captured scenes from the park, and later I explored the city center (Śródmieście) with my brushes. Gdańsk offered not just new subjects, but a fresh sense of artistic freedom.",
            "During this time, friends invited me to visit Denmark — and I gladly accepted. It was my first encounter with the country, and it opened yet another door in my creative journey."
        ],
        "images": []
    },
    {
        "tab": "A New Chapter in Denmark",
        "paragraphs": [
            "While living in Poland, I took a short trip to Denmark to visit some friends. They warmly welcomed me and introduced me to the beauty of their country. In just a few days, we visited many places, and I was deeply moved by the atmosphere — there was a quiet elegance and thoughtful design everywhere. Even in the smallest villages, houses were well-kept, with cozy gardens and no fences. It felt open, peaceful, and inspiring. I promised myself I would return as soon as possible.",
            "Six months later, in March 2019, I accepted an invitation to work in Denmark. The job was physically demanding, and adjusting to a new culture and rhythm of life wasn't easy at first. But I was determined — I wanted not only to live there but to absorb everything the country had to offer.",
            "After a few months, I began to settle in. I traveled, visited museums, galleries, and explored new cities. On one of my trips, I visited Odense and discovered Filosoffen — a unique space combining a café and an art space. The people there were kind and open. After speaking with them, we arranged an exhibition of my work.",
            "In November 2019, the exhibition took place at Filosoffen. I presented 11 of my paintings, which I had brought from Ukraine. It was a meaningful experience — to share my art in a new country, meet people, and hear their responses. After the exhibition, I returned to Ukraine, filled with gratitude and thinking about what would come next."
        ],
        "images": [
            {
                "id": 1,
                "title": "Landscape in Aalborg_view",
                "src": "../resources/img/periods/501.jpg"
            },
            {
                "id": 2,
                "title": "Harbour in Skive_view",
                "src": "../resources/img/periods/502.jpg"
            },
            {
                "id": 3,
                "title": "Landscape in Danish forest_view",
                "src": "../resources/img/periods/503.jpg"
            },
            {
                "id": 4,
                "title": "Landscape in Aalborg 2_view",
                "src": "../resources/img/periods/504.jpg"
            }
        ]
    },
    {
        "tab": "Settling in Kamianka",
        "paragraphs": [
            "In the spring of 2020, I decided to settle in Kamianka, a town in the Cherkasy region known for its rich history, stunning Tiasmyn Canyon, and beautiful natural landscapes. I had visited several times before, staying with friends, and had always admired the scenery. It felt like the perfect place to focus on my art.",
            "The canyon's breathtaking views inspired me deeply, and I spent much of my time painting the landscape. The natural beauty around me provided endless opportunities for creativity. I worked prolifically, creating a variety of pieces that captured the essence of this special place.",
            "By September, I felt satisfied with the work I had done and took a break, waiting for the return of spring. When spring 2021 arrived, I resumed painting, continuing to explore the town's views and landscapes. I painted throughout the season, up until the end of July, always searching for new perspectives and ways to capture the beauty of my surroundings."
        ],
        "images": [
            {
                "id": 1,
                "title": "Tiasmyn river with a rock_view",
                "src": "../resources/img/periods/601.jpg"
            },
            {
                "id": 2,
                "title": "Evening landscape on a beach_view",
                "src": "../resources/img/periods/602.jpg"
            },
            {
                "id": 3,
                "title": "Sunny landscape with a path_view",
                "src": "../resources/img/periods/603.jpg"
            },
            {
                "id": 4,
                "title": "Landscape with a fisher_view",
                "src": "../resources/img/periods/604.jpg"
            },
            {
                "id": 5,
                "title": "Tiasmyn river_view",
                "src": "../resources/img/periods/605.jpg"
            },
            {
                "id": 6,
                "title": "Fairy valley_view",
                "src": "../resources/img/periods/606.jpg"
            },
            {
                "id": 7,
                "title": "Green valley_view",
                "src": "../resources/img/periods/607.jpg"
            },
            {
                "id": 8,
                "title": "Native lands_view",
                "src": "../resources/img/periods/608.jpg"
            },
            {
                "id": 9,
                "title": "Spring_view",
                "src": "../resources/img/periods/609.jpg"
            },
            {
                "id": 10,
                "title": "Summer landscape_view",
                "src": "../resources/img/periods/610.jpg"
            },
            {
                "id": 11,
                "title": "Early spring_view",
                "src": "../resources/img/periods/611.jpg"
            },
            {
                "id": 12,
                "title": "Summer landscape with a path_view",
                "src": "../resources/img/periods/612.jpg"
            }
        ]
    },
    {
        "tab": "Inspiration in Athens",
        "paragraphs": [
            "At the end of July 2021, I traveled to Athens, Greece. The Mediterranean climate was perfect for my work — hot, dry summers with no rain, where the weather remained consistently warm each day. For an artist, this was ideal: the views were constant, the conditions predictable, and the bright colors of the landscape became a powerful source of inspiration.",
            "Athens enchanted me. The combination of ancient architecture, the deep azure sea, and the surrounding mountains was captivating. I was eager to capture this beauty on my canvases. I painted almost every day, wandering through the city to discover new views for my work. From the mountains, I was treated to breathtaking vistas of the city and the sea below.",
            "I approached this trip as an artistic endeavor, working quickly to capture as many views as I could. Over the course of two months, I immersed myself in the landscape, exploring the city's charm and working diligently to translate its essence onto my canvases. When my time in Athens came to an end, I returned to Ukraine, already planning my next artistic journey."
        ],
        "images": [
            {
                "id": 1,
                "title": "Descent to a quay_view",
                "src": "../resources/img/periods/701.jpg"
            },
            {
                "id": 2,
                "title": "Piraeus_view",
                "src": "../resources/img/periods/702.jpg"
            },
            {
                "id": 3,
                "title": "View on a mountain_view",
                "src": "../resources/img/periods/703.jpg"
            },
            {
                "id": 4,
                "title": "Zappeion_view",
                "src": "../resources/img/periods/704.jpg"
            },
            {
                "id": 5,
                "title": "View on Pireus_view",
                "src": "../resources/img/periods/705.jpg"
            },
            {
                "id": 6,
                "title": "Akadimias street_view",
                "src": "../resources/img/periods/706.jpg"
            },
            {
                "id": 7,
                "title": "Archiflame_view",
                "src": "../resources/img/periods/707.jpg"
            },
            {
                "id": 8,
                "title": "Evening view on a sea_view",
                "src": "../resources/img/periods/708.jpg"
            },
            {
                "id": 9,
                "title": "View on Lycabettus Hill_view",
                "src": "../resources/img/periods/709.jpg"
            },
            {
                "id": 10,
                "title": "View on Acropoli_view",
                "src": "../resources/img/periods/710.jpg"
            },
            {
                "id": 11,
                "title": "Aiolou street_view",
                "src": "../resources/img/periods/711.jpg"
            },
            {
                "id": 12,
                "title": "Analatou street_view",
                "src": "../resources/img/periods/712.jpg"
            },
            {
                "id": 13,
                "title": "Park of Nea Smyrni_view",
                "src": "../resources/img/periods/713.jpg"
            },
            {
                "id": 14,
                "title": "Road to a sea_view",
                "src": "../resources/img/periods/714.jpg"
            },
            {
                "id": 15,
                "title": "Sunset on a quay_view",
                "src": "../resources/img/periods/715.jpg"
            },
            {
                "id": 16,
                "title": "Path to a top_view",
                "src": "../resources/img/periods/716.jpg"
            },
            {
                "id": 17,
                "title": "Filopappou Hill_view",
                "src": "../resources/img/periods/717.jpg"
            },
            {
                "id": 18,
                "title": "View on Athens_view",
                "src": "../resources/img/periods/718.jpg"
            },
            {
                "id": 19,
                "title": "Breathtsking view_view",
                "src": "../resources/img/periods/719.jpg"
            }
        ]
    },
    {
        "tab": "Art in Times of War",
        "paragraphs": [
            "On February 24, 2022, russia attacked Ukraine. The shock and horror of the invasion overwhelmed me. My thoughts were consumed not by painting, but by the unimaginable violence and suffering unfolding in my country. It was a nightmare. In those early months, the idea of creating art seemed distant and almost irrelevant.",
            "However, by the summer, I began to paint again, if only as a way to distract myself from the harsh reality of the war. It became a small escape, a moment of peace amidst the chaos. In the autumn, I rented a flat — a safe space where I could focus on my work. There, I began to create still lifes, interior scenes, and paintings of people — subjects I hadn't explored in nearly nine years.",
            "Painting interiors allowed me to experiment with composition, color, and form. I couldn't bear the idea of repeating the same work, so each piece became an opportunity to change something: a new perspective, a different arrangement, or an altered color palette. For me, every painting had to be unique and engaging."
        ],
        "images": [
            {
                "id": 1,
                "title": "Still life with gladioli and peaches_view",
                "src": "../resources/img/periods/801.jpg"
            },
            {
                "id": 2,
                "title": "Still life with gladioli and a tea set_view",
                "src": "../resources/img/periods/802.jpg"
            },
            {
                "id": 3,
                "title": "Lilies with an eastern jug_view",
                "src": "../resources/img/periods/803.jpg"
            },
            {
                "id": 4,
                "title": "White lilies and an eastern jug_view",
                "src": "../resources/img/periods/804.jpg"
            },
            {
                "id": 5,
                "title": "Anastasiia_view",
                "src": "../resources/img/periods/805.jpg"
            },
            {
                "id": 6,
                "title": "Sun in the room_view",
                "src": "../resources/img/periods/806.jpg"
            },
            {
                "id": 7,
                "title": "Room and Sapho_view",
                "src": "../resources/img/periods/807.jpg"
            },
            {
                "id": 8,
                "title": "Still life with room flowers_view",
                "src": "../resources/img/periods/808.jpg"
            },
            {
                "id": 9,
                "title": "Room of a poetess_view",
                "src": "../resources/img/periods/809.jpg"
            },
            {
                "id": 10,
                "title": "Tea set_view",
                "src": "../resources/img/periods/810.jpg"
            },
            {
                "id": 11,
                "title": "Room of shadows_view",
                "src": "../resources/img/periods/811.jpg"
            },
            {
                "id": 12,
                "title": "Summer landscape in a city_view",
                "src": "../resources/img/periods/812.jpg"
            },
            {
                "id": 13,
                "title": "Still life with chrysanthemums and grape_view",
                "src": "../resources/img/periods/813.jpg"
            },
            {
                "id": 14,
                "title": "Chrysanthemums with orange background_view",
                "src": "../resources/img/periods/814.jpg"
            },
            {
                "id": 15,
                "title": "Sunflowers_view",
                "src": "../resources/img/periods/815.jpg"
            }
        ]
    },
    {
        "tab": "A New Chapter: Teaching",
        "paragraphs": [
            "In September 2023, I began working at an art college — a role I hadn't anticipated but found to be both fulfilling and inspiring. Teaching at the college turned out to be a truly interesting experience, especially because it gives me the opportunity to draw almost every day.",
            "I try to be responsible with my students and willingly share my knowledge. I enjoy sparking their curiosity with engaging stories about artists and helping them see the beauty of painting through art itself.",
            "In the spring of 2024, I returned to painting with renewed energy. My first works were familiar — views from my window — but this time, I allowed myself to transform the scene. I altered the buildings, streets, trees — everything was open to change. It was a process of reinvention, where nothing was fixed, and my surroundings became a platform for experimentation.",
            "As I continued to paint, I moved to larger canvases, exploring a space between realism and abstraction. Each new piece was driven by my personal experiences, my environment, and the emotions that came with them. Every painting carried a unique idea and inspiration — an expression of the senses that motivated me to create."
        ],
        "images": [
            {
                "id": 1,
                "title": "Evening by the sea_view",
                "src": "../resources/img/periods/901.jpg"
            },
            {
                "id": 2,
                "title": "Everything is gray_view",
                "src": "../resources/img/periods/902.jpg"
            },
            {
                "id": 3,
                "title": "Square evening light_view",
                "src": "../resources/img/periods/903.jpg"
            },
            {
                "id": 4,
                "title": "My native city Cherkasy_view",
                "src": "../resources/img/periods/904.jpg"
            },
            {
                "id": 5,
                "title": "Black room (not finished)_view",
                "src": "../resources/img/periods/905.jpg"
            },
            {
                "id": 6,
                "title": "Cozy evening light_view",
                "src": "../resources/img/periods/906.jpg"
            },
            {
                "id": 7,
                "title": "Evening by the sea_view 2",
                "src": "../resources/img/periods/907.jpg"
            }
        ]
    }
]